#define _CRT_SECURE_NO_WARNINGS  1
//
//int main()
//{
//	char a = 3;
//	char b = 127;
//	char c = a + b;
//	printf("%d", c);   //-126
////a和b要整型提升00000011-a  01111111-b
////00000000000000000000000000000000011 -整型后a
////00000000000000000000000000001111111 -整型后b
////00000000000000000000000000010000010 -相加结果
////再放入char中，发生截断得10000010 -c
////当要打印时，c->%d,c仍需要整型提升 
////11111111111111111111111111110000010 -整型后c补码
////11111111111111111111111111110000001 -反码
////00000000000000000000000000001111110 -原码 
////1111110  --截断后 == -126
//	
//	printf("%d", a + b);  //130
//	//没有存入char，所以不发生截断
//	return 0;
//}
//
//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101-a
//	//00000000000000000000000000000010按位或 
//	//也就是 a | （1<<（n-1））--要求第n位0变1
//	//00000000000000000000000000001111 -得到得结果
//	//
//	//恢复原来的数
//	//a & (~(1<<(n-1)))\
//	//00000000000000000000000000001111
//	//11111111111111111111111111111101-取反后的数
//	//得到00000000000000000000000000001101-a
//	return 0;
////}
//#include <stdio.h>
//int main()
//{
//	int count = 0;
//	int x = 13;
//	int y = 7;
//	while (x > 0 || y > 0)
//	{
//		int a = x % 2;
//		int b = y % 2;
//		if (a == b)
//			count++;
//		x = x >> 1;
//		y = y >> 1;
//	}
//	printf("%d", count);
//	return 0;
//}
//#include <stdio.h>
//int calc_diff_bit(int m, int n)
//{
//	int tmp = m^n;
//	int count = 0;
//	while (tmp)
//	{
//		tmp = tmp&(tmp - 1);
//		count++;
//	}
//	return count;
//}


//
//int main()//打印整数二进制的奇数位和偶数位
//{
//	int a = 10;
//	int i = 0;
//	for (i = 0; i < 32; i += 2)
//	{
//		printf("%d ", (a >> i) % 2);
//	}
//	printf("\n");
//	for (i = 1; i < 32; i += 2)
//	{
//		printf("%d ", (a >> i) % 2);
//	}
//	printf("\n");
//	return 0;
//}


//int main()
//{
//	int a;
//	scanf("%d", &a);
//	int i;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if ((a >> i) & 1 == 1)
//			count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}